#### Terraform Plan - Portal Infrastructure
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.app will be created
  + resource "aws_secretsmanager_secret" "app" {
      + arn                            = (known after apply)
      + description                    = "Django application secrets"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "shifter-prod-portal-app"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "shifter-prod-portal-app"
          + "Project"     = "shifter"
        }
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "shifter-prod-portal-app"
          + "Project"     = "shifter"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.app will be created
  + resource "aws_secretsmanager_secret_version" "app" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # random_password.django_secret_key will be created
  + resource "random_password" "django_secret_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 50
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_secret_arn            = (known after apply)

```

</details>

*Pushed by: @Brad-Edwards*